Config/Catalogs/РазделыЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РазделыЛицевыхСчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЛицевыеСчета</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсточникСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитическийКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйКонтракт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГосударственныеОборонныеЗаказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоступленияЕБП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыПоступленийЕБП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопустимыеКФО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Enums/МодулиИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>МодулиИнтеграции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕБПАУБУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетИнтеграции</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/РазделыЛицевыхСчетов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Проверить выполнение отложенных обработчиков
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект); 
	
	Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не указан лицевой счет для записи раздела!'"),,,, Отказ);  
		Возврат;
	Конецесли;	
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Запись раздела лицевого счета %1'"), Объект.Владелец);
		УстановитьВидимостьЭлементов();
	Иначе
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Запись раздела лицевого счета %1: %2, код %3'"), Объект.Владелец, Объект.Наименование, Объект.Код);
	КонецЕсли;
	Заголовок = Текст;  
	
	// ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ВерсионированиеОбъектов 
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Требуется для обновления списка допустимых КФО и Источников средств по лицевому счету
	ОбновитьПовторноИспользуемыеЗначения();
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Запись раздела лицевого счета %1: %2, код %3'"),Объект.Владелец,Объект.Наименование,Объект.Код);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект); 
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсточникСредствПриИзменении(Элемент)
	УстановитьКодИсточникаСредств(Объект.ИсточникСредств);
	Если ЗначениеЗаполнено(Объект.КодПоступленияЕБП) Тогда
		 Объект.КодПоступленияЕБП = ПредопределенноеЗначение("Перечисление.КодыПоступленийЕБП.ПустаяСсылка");
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура КодПоступленияЕБППриИзменении(Элемент)
	УстановитьКодИсточникаСредств(Объект.КодПоступленияЕБП);  
	Если ЗначениеЗаполнено(Объект.ИсточникСредств) Тогда
		 Объект.ИсточникСредств = ПредопределенноеЗначение("Справочник.ИсточникиСредств.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АналитическийКодПриИзменении(Элемент)
	ОбновитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НадписьПомощникЗаменыРазделаНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЛицевойСчет", Объект.Владелец);
	
	ОткрытьФорму("ОбщаяФорма.ПомощникЗаменыРазделовЛицевогоСчета", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотБазоваяФункциональностьКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьКодИсточникаСредств(Источник)
	
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.ИсточникиСредств") Тогда
		Объект.Код = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "Код"); 
	Иначе
		Объект.Код = Лев(Источник, 2);     
	КонецЕсли;
	
	ОбновитьНаименование();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()  
	
	ИспользуетсяКСНаРазделахСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "КазначейскоеСопровождениеНаРазделах"); 
	ИспользуетсяИнтеграцияЕБП = Объект.Владелец.МодульИнтеграции = ПредопределенноеЗначение("Перечисление.МодулиИнтеграции.ЕБПАУБУ");
	
	Если ИспользуетсяИнтеграцияЕБП Тогда
		Элементы.КодПоступленияЕБП.СписокВыбора.Очистить();
		Элементы.КодПоступленияЕБП.СписокВыбора.ЗагрузитьЗначения(Перечисления.КодыПоступленийЕБП.ДействующиеКодыПоступлений(Объект.Владелец.Код));
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаКазначейскоеСопровождение", "Видимость", ИспользуетсяКСНаРазделахСчета);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "НадписьПомощникЗаменыРаздела", "Видимость", ИспользуетсяКСНаРазделахСчета); 
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ИсточникСредств", "Видимость", НЕ ИспользуетсяИнтеграцияЕБП); 
		
    ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "КодПоступленияЕБП", "Видимость", ИспользуетсяИнтеграцияЕБП); 

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы, "ГруппаКФО", "Видимость", НЕ ИспользуетсяИнтеграцияЕБП); 

КонецПроцедуры

&НаСервере
Процедура ОбновитьНаименование()
	
	ВладелецНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "Наименование");
	
	Объект.Наименование = "("
							+ Объект.Код
							+ ?(ЗначениеЗаполнено(Объект.АналитическийКод), ", " + Объект.АналитическийКод, "")
							+ ") "
							+ ВладелецНаименование;
	
КонецПроцедуры

#КонецОбласти
